//=============================================================================
//
// 撃破数計数器 [DefeatCounter.h]
// Author : 宋彦霖
//
//=============================================================================
#ifndef _DEFEATCOUNTER_INCLUDE_H_
#define _DEFEATCOUNTER_INCLUDE_H_

//*****************************************************************************
// クラス定義
//*****************************************************************************
class DefeatCounter
{
private:
	int count;
	
public:
	DefeatCounter();

	void CountUp(void);
	int GetCount(void);
	void SetCount(int value);

};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
DefeatCounter *GetDefeatCounter(int no);
int GetAllDefeat(void);

#endif