//=============================================================================
//
// [EnemyPosData.h]
// Author : 宋彦霖
//
//=============================================================================
#ifndef _ENEMYPOSDATA_INCLUDE_H_
#define _ENEMYPOSDATA_INCLUDE_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define ENEMYPOS_MAX (27)

//*****************************************************************************
// クラス定義
//*****************************************************************************
class EnemyPosData
{
private:
	bool use;
	float x;
	float z;

public:
	EnemyPosData();

	void SetUse(bool use);
	void SetPos(float x, float z);

	bool GetUse(void);
	float GetPosX(void);
	float GetPosZ(void);
	
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
EnemyPosData *GetEnemyPosData(int no);
void InitEnemyPosData(void);

#endif