//=============================================================================
//
// リザルト画面処理 [Game.h]
//
//=============================================================================
#ifndef _RANKING_INCLUDE_H_
#define _RANKING_INCLUDE_H_


#include <Windows.h>


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitRanking(void);
void UninitRanking(void);
void UpdateRanking(void);
void DrawRanking(void);

#endif
