//=============================================================================
//
// ステージ管理 [StageManager.h]
// Author : 宋彦霖
//
//=============================================================================
#ifndef _STAGEMENEGER_INCLUDE_H_
#define _STAGEMENEGER_INCLUDE_H_

#include "Library/Vector.h"
#include <Windows.h>
#include <d3dx9.h>

//*****************************************************************************
// 列挙型
//*****************************************************************************
enum EN_STAGE
{
	STAGE_01_AKIBA = 0,
	STAGE_02_USA,
	STAGE_03_SPACE,

	STAGE_MAX,
};

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	int no;

	// 時間制御系
	int timer;
	int nextStage;
	int timeLimit[STAGE_MAX];

	// 状態制御系
	int status;

} STAGE;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
STAGE *GetStage(void);

void InitStage(void);
void UpdateStage(void);

#endif