//=============================================================================
//
// voiceten発射処理 [VLauncher.cpp]
// Author : 宋彦霖
//
//=============================================================================
#include "VLauncher.h"

#include "Library/DebugProcess.h"
#include "voiceten.h"
#include "voicetank.h"
#include "AimPointer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define V_FREQ (6)	// 発射頻度、1発 : frame

//*****************************************************************************
// グローバル変数
//*****************************************************************************
int timerVL;

//=============================================================================
// Voiceten Launcher
//=============================================================================
void UpdateVLauncher(void)
{
	if (CEnergyTankUI::GetVoiceVolume() > 30)				// 30 : 一定値以下を無視
	{
		Vector2 direction = AimPointer::GetPosition();

		if (timerVL % V_FREQ == 0)
		{
			SetVoiceten(
				Vector3(0.0f, 250.0f, -800.0f),					// 発射位置
				Vector3(direction.x, direction.y, 0.0f));		// 目標位置
		}

		// タイマーカウントアップ
		timerVL++;

	}
	else
	{
		timerVL = 0;
	}

}
