//=============================================================================
//
// voiceten発射処理 [VLauncher.h]
// Author : 宋彦霖
//
//=============================================================================
#ifndef _VLAUNCHER_INCLUDE_H_
#define _VLAUNCHER_INCLUDE_H_

#include "Library/Vector.h"
#include <Windows.h>
#include <d3dx9.h>

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void UpdateVLauncher(void);

#endif