//=============================================================================
//
// voiceten処理 [voicetenTest.h]
// Author : 宋彦霖
//
//=============================================================================
#ifndef _VOICETENTEST_INCLUDE_H_
#define _VOICETENTEST_INCLUDE_H_

#include "Library/Vector.h"
#include <Windows.h>
#include <d3dx9.h>

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

void TestVL(void);


#endif