//=============================================================================
//
//木村担当分　workKimura.h
//
//=============================================================================
#ifndef _WORKKIMURA_H_
#define _WORKKIMURA_H_




//=============================================================================
//プロトタイプ宣言
//=============================================================================
HRESULT InitWorkKimura(void);
void UninitWorkKimura(void);
void UpdateWorkKimura(void);
void DrawWorkKimura(void);

#endif