//=============================================================================
//
//木村担当分　workenemy.cpp
//　一年の時にやったmain.cppと同じやり方で
//=============================================================================

//必須インクルード
#include <windows.h>
#include "Library\ObjectBase3D.h"
#include "enemy.h"


//木村担当分インクルード

//グローバル宣言
C3DPolygonObject ENEMY3D;//エネミー1
C3DPolygonObject ENEMY3D2;//エネミー2
C3DPolygonObject ENEMY3D3;//エネミー3


//=============================================================================
//初期化処理
//=============================================================================
HRESULT InitENEMY(void)
{
	//エネミー1
	ENEMY3D.Init(Vector3(0, 200, 200), Vector2(300, 300));
				//ポジション設定		//サイズ設定

	ENEMY3D.LoadTexture("data/MODEL/カービー.dds");
			//テクスチャの読み込み

	//エネミー2
	ENEMY3D2.Init(Vector3(100, 0, 200), Vector2(300, 300));
	//ポジション設定		//サイズ設定

	ENEMY3D2.LoadTexture("data/MODEL/すたふぃー.dds");


	//エネミー3
	ENEMY3D3.Init(Vector3(500, 500, 200), Vector2(300, 300));
	//ポジション設定		//サイズ設定

	ENEMY3D3.LoadTexture("data/TEXTURE/toumeienemy.png");

	return S_OK;
}

//=============================================================================
//終了処理　※記載場所注意
//=============================================================================
void UninitENEMY(void)
{
	//エネミー1
	ENEMY3D.Release();
	//エネミー2
	ENEMY3D2.Release();
	//エネミー3
	ENEMY3D3.Release();



}

//=============================================================================
//更新処理
//=============================================================================
void UpdateENEMY(void)
{


}

//=============================================================================
//描画処理
//=============================================================================
void DrawENEMY(void)
{
	//エネミー1
	ENEMY3D.Draw();
	//エネミー2
	ENEMY3D2.Draw();
	//エネミー3
	ENEMY3D3.Draw();

}