//=============================================================================
//
// リザルト画面処理 [result.h]
//
//=============================================================================
#ifndef _RESULT_INCLUDE_H_
#define _RESULT_INCLUDE_H_


#include <Windows.h>


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif
