//=============================================================================
//
//宇都木担当分　workUtsugi.h
//
//=============================================================================
#ifndef _WORKUTSUGI_H_
#define _WORKUTSUGI_H_




//=============================================================================
//プロトタイプ宣言
//=============================================================================
HRESULT InitWorkUtsugi(void);
void UninitWorkUtsugi(void);
void UpdateWorkUtsugi(void);
void DrawWorkUtsugi(void);

#endif